[
  {
    "papername" : "Y.-T. Wu, M.-C. Yu, J.-S. Leu, E.-C. Lee and T. Song, “Design and Implementation of Various File Deduplication Schemes on Storage Devices,” 11th EAI International Conference on Heterogeneous Networking for Quality, Reliability, Security and Robustness (QShine 2015), Taipei, Taiwan, pp. xxx-xxx, Aug. 19-20 2015. ",
  "type" : "conference"
  },
  {
    "papername" : "J.-S. Leu and T. Song, “Received Signal Strength Indication(RSSI) Prediction-based Adaptive H.264/SVC Video Service on Smartphone,” (Invited speech) International Forum on Advanced Technologies(IFAT2015), Tokushima, Japan, Mar. 9, 2015",
  "type" : "conference"
  },
  {
    "papername" : "K.-C. Hsu and J.-S. Leu, “ Improving the Efficiency of Presence Service in IMS by JSON,” in The Seventh International Conference on Ubiquitous and Future Networks (ICUFN 2015), pp. 547-550, Sapporo, Japan, July 7-10, 2015.",
  "type" : "conference"
  },
  {
    "papername" : "Y.-S. A. Chen, R.-H. Liang, J.-S. Leu, “The Effect of Consumers’ Regulatory Focus on the Development of Portable Health Monitoring and Emergency Assistance for Senior Citizen,” The 15th Asia Pacific Industrial Engineering and Management Systems Conference(APIEMS 2014), Jeju, Koren, Oct. 12-15, 2014.",
  "type" : "conference"
  },
  {
    "papername" : "T.-Y. Chu, K.-C. Hsu, J.-S. Leu, “Design and Implementation of an Open Data Assisted Real-time Trip Planner,” 2014 International Conference on Intelligent Green Building and Smart Grid (IGBSG), pp. 1-4, Taipei, Taiwan, Apr. 23-25 2014.",
  "type" : "conference"
  },
  {
    "papername" : "T.-H. Chiang and J.-S. Leu, “Regional Energy Aware Clustering with Isolated Nodes in Wireless Sensor Networks,” 2014 IEEE 25th International Symposium on Personal, Indoor and Mobile Radio Communications (IEEE PIMRC 2014), pp. 1829-1833, Washington DC, USA, Sep. 2-5, 2014.",
  "type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, C.-T. Chen and T.-H. Chiang, “Prolonging WSN Lifetime with Data-Location Similarity and Weakest Node Protection,” accepted for oral presentation in The 79th IEEE Vehicular Technology Conference (IEEE VTC 2014 Spring), Seoul, Korea, May 18-21, 2014.",
	"type" : "conference"
  },
  {
    "papername" : "J. H. Chen, J.-S. Leu, K. H. Li, “Hybrid Searching Scheme Supported by Dynamic Weighted Distributed Label Clustering in Social Networks,” The 19th Asia-Pacific Conference on Communications (APCC 2013), pp. 615-619, Bali Island, Indonesia, Aug. 29-31 2013.",
	"type" : "conference"
  },
  {
    "papername" : "C. H. Lin, J.-S. Leu and M.-C. Yu, “Multiple Access Image Surveillance System in a Heterogeneous Network Environment”, The 17th IEEE International Symposium on Consumer Electronics (ISCE 2013), pp. 215-216, Hsinchu, Taiwan, Jun. 3-6, 2013.",
	"type" : "conference"
  },
  {
    "papername" : "P. Vajsar, J. Hosek, P. Masek, N. Makhlouf, J.-S. Leu, “Design of QoS Model for Mobile Ad-hoc Network,” the 36th International Conference on Telecommunications and Signal Processing (TSP 2013), pp. 111-117, Rome, Italy, Jul. 2-4 2013.",
	"type" : "conference"
  },
  {
    "papername" : "K.-H. Li, J.-S. Leu, and J. Hosek, “Ant-based On-demand Clustering Routing Protocol for Mobile Adhoc Networks,” The Seventh International Conference on Innovative Mobile and Internet Services in Ubiquitous Computing (IMIS-2013), pp. 354-359, Taichung, Taiwan, Jul. 3-5 2013.",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, K.-W. Su, T.-Y. Chu, C.-H. Hsieh, Y.-S. A. Chen, and J. P. Ma, “Pointer Wizard - A Remote Interaction User Interface,” The 11th ACM Annual International Conference on Mobile Systems, Applications, and Services (ACM MobiSys 2013), pp. 477-478, Taipei, Taiwan, Jun. 25-28 2013.",
	"type" : "conference"
  },
  {
    "papername" : "W.-B. Hsieh and J.-S. Leu, “A Dynamic Identity User Authentication Scheme in Wireless Sensor Networks,” 9th IEEE International Wireless Communications and Mobile Computing Conference (IEEE IWCMC 2013), pp. 1132-1137, Cagliari, Sardinia, Italy, Jul. 1-5, 2013.",
	"type" : "conference"
  },{
    "papername" : "T.-K. Cheng, F.-M. Yang, J.-S. Leu, J.-L. C. Wu,“IEEE 802.16e/m Energy-Efficient Sleep Mode with Packet Scheduling in Multi-Broadcast Services,” 18th IEEE International Conference on Networks(ICON 2012), Singapore, Dec. 12-14 2012.",
	"type" : "conference"
  },
  {
    "papername" : "J. Mora and J.-S. Leu, “Intelligent Power Saving Technique for Mobile Devices,” The 18th Asia-Pacific Conference on Communications (APCC 2012), pp. 504-508, Jeju island, Korea, Oct. 15-17 2012.",
	"type" : "conference"
  },
  {
    "papername" : "H.-Y. Shih and J.-S. Leu, “Improving Resource Utilization in a Heterogeneous Cloud Environment,” The 18th Asia-Pacific Conference on Communications (APCC 2012), pp. 185-189, Jeju island, Korea, Oct. 15-17 2012.",
	"type" : "conference"
  },
  {
    "papername" : "H.-Y. Shih, J.-J. Huang, and J.-S. Leu, “Dynamic Slot-based Task Scheduling Based on Node Workload in a MapReduce Computation Model,” The 6th IEEE International Conference on Anti-counterfeiting, Security, and Identification (IEEE ASID 2012), pp. 185-189, Taipei, Taiwan, Aug. 24-26 2012.",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu and H.-J. Tzeng, “Received Signal Strength Fingerprint and Footprint Assisted Indoor Positioning Based on Ambient Wi-Fi Signals,” The 75th IEEE Vehicular Technology Conference (IEEE VTC 2012 Spring), Yokohama, Japan, May 6-9, 2012.",
	"type" : "conference"
  },
  {
    "papername" : "M.-S. Lin, J.-S. Leu, W.-C. Yu, K.-H. Li, and J.-L. C. Wu, “TBRA: Termites Based Routing Algorithm in 3D Wireless Sensor Networks,” The 75th IEEE Vehicular Technology Conference (IEEE VTC 2012 Spring), Yokohama, Japan, May 6-9, 2012.",
	"type" : "conference"
  },
  {
    "papername" : "M.-C. Yu and J.-S. Leu,“Adaptive Weighted Scheme for Improving Mobile Sensor Node Connectivity in the IEEE 802.15.4 Network,” the 13th IEEE/IFIP Network Operations and Management Symposium (IEEE/IFIP NOMS 2012), pp. 968-973, Maui, Hawaii, USA, Apr. 16-20, 2012.",
	"type" : "conference"
  },
  {
    "papername" : "N. H. Tung and J.-S. Leu,“Design and Implementation of Game Controller on Smartphone,” 2012 IEEE International Conference on Consumer Electronics (IEEE ICCE 2012), pp. 684-685, Las Vegas, NV, USA, Jan. 13-16 2012.",
	"type" : "conference"
  },
  {
    "papername" : "C.-T. Chen, J.-S. Leu, K.-W. Su, Z.-Y. Zhu, T.-H. Chiang, “Design and Implementation of a Mobile Ambient Intelligence Based Mesoscale Weather Forecasting System,” 2012 IEEE International Conference on Consumer Electronics (IEEE ICCE 2012), pp. 566-567, Las Vegas, NV, USA, Jan. 13-16 2012.",
	"type" : "conference"
  },
  {
    "papername" : "T.-Y. Chen, H.-W. Wei, J.-S. Leu, and W.-K. Shih, “EDZL Scheduling for Large-Scale Cyber Services on Real-Time Cloud,” 2011 IEEE International Conference on Service Oriented Computing and Applications (IEEE SOCA 2011), pp. 1-3, Irvine, USA, 12-14 Nov. 2011.",
	"type" : "conference"
  },
  {
    "papername" : "H.-C. Yueh and J.-S. Leu, “Virtual Grouping Byzantine Agreement: A compromised consensus scheme for a cooperative network ,” 7th IEEE International Wireless Communications and Mobile Computing Conference (IEEE IWCMC 2011), pp. 1877 - 1882, Istanbul, Turkey, Jul. 5-8, 2011.",
	"type" : "conference"
  },
  {
    "papername" : "W.-B. Hsieh and J.-S. Leu, “Design of a Time and Location Based One-Time Password Authentication Scheme,” 7th IEEE International Wireless Communications and Mobile Computing Conference (IEEE IWCMC 2011), pp. 201 - 206, Istanbul, Turkey, Jul. 5-8, 2011.",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, W.-H. Lin, M.-C. Yu, and H.-J. Tzeng, “Recognition Assisted Dynamic Surveillance System Based on OSGi and OpenCV,” The 13th International Conference on Advanced Communication Technology (ICACT 2011), pp. 83-87, Phoenix Park, Korea, Feb. 13-16 2011.",
	"type" : "conference"
  },
  {
    "papername" : "M.-S. Lin, J.-S. Leu, W.-C. Yu, M.-C. Yu, and J.-L. C. Wu, “On Transmission Efficiency of the Multimedia Service over IEEE 802.15.4 Wireless Sensor Networks,” The 13th International Conference on Advanced Communication Technology (ICACT 2011), pp. 184-189, Phoenix Park, Korea, Feb. 13-16 2011.",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, Y.-S. Yee, W.-L. Chen, “Performance Evaluation of Map-Reduce on Large-scale Data Processing”, The 2010 IEEE International Symposium on Parallel and Distributed Processing with Applications (ISPA 2010), pp. 244-248, Taipei, Taiwan, Sep. 6-9, 2010.",
	"type" : "conference"
  },
  {
    "papername" : "H.-C. Hsieh, J.-S. Leu, and W.-K. Shih,“Improving Robustness in an Autonomous Local Sensor Network,”, the 2010 IEEE Consumer Communications and Networking Conference (IEEE CCNC 2010), pp.1-5, Las Vegas, NV, USA, Jan. 9-12 2010. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu and Y.-S. Yee, “A Simulation Comparison of VoIP over Wi-Fi and WiMAX”, The 7th IEEE VTS Asia Pacific Wireless Communications Symposium (APWCS 2010), Kaohsiung, Taiwan, May 20-21, 2010.",
	"type" : "conference"
  },
  {
    "papername" : "P.-C. Liu, C.-W. Yi, Y.-T. Chuang, H.-H. Lu, J.-S. Leu, and W.-K. Shih, “On the capacity of tree-based P2P streaming systems,” the Sixth International Workshop on Mobile Peer-to-Peer Computing (MP2P 2010) in conjunction with the Eighth IEEE International Conference on Pervasive Computing and Communications (IEEE PerCom 2010), pp. 117-122, Mannheim, Germany, 29 Mar.-2 Apr. 2010.",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu and M.-H. Huang, “Piece-based File Sharing over a Peer-to-Peer Network in a Heterogeneous Network Environment”, The 13th IEEE International Symposium on Consumer Electronics (IEEE ISCE 2009), pp.881-884, Kyoto, Japan, May 25-28, 2009. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, C.-W. Tsai and C.-W. Yi, “Improving Adaptive Streaming Service across Wired/Wireless Network”, International Workshop on Mobile Media Retrieval (MMR) in conjunction with The 10th International Conference on Mobile Data Management (MDM 2009), pp.614-618, Taipei, Taiwan, May 18-20, 2009. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, C.-K. Lin, M.-S. Lin and J.-L. C. Wu, “Enhancing the Quality of Experience by Accelerating User Requests in a Multi-Wireless-Carrier Environment”, The Fifth International Conference on Wireless and Mobile Communications (ICWMC 2009), pp. 54 - 57, Cannes/La Bocca, France, Aug. 23-29, 2009. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, W.-H. Lin, and H.-J. Tzeng, “Design and Implementation of an OSGi-Centric Remote Mobile Surveillance System,” the IEEE International Conference on Systems, Man, and Cybernetics (IEEE SMC 2009), pp.2572-2576, San Antonio, Texas, USA, Oct. 11-14, 2009. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu and M.-H. Huang, “Comparison of Piece-based File Sharing Schemes over a Peer-to-Peer Network in a Heterogeneous Network Environment”, IEEE Global Communications Conference (IEEE GLOBECOM 2009), pp.1-6, Honolulu, Hawaii, USA, Nov. 30 - Dec. 4, 2009. [EI](Acceptance Rate: 1104/3200 = 34.8%)(NSC-98-2221-E-011-095-)",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu and C.-W. Tsai, “A Novel Popularity-Independent Resource Locating Scheme in a P2P Network”, The 20th IEEE Personal, Indoor and Mobile Radio Communications Symposium 2009 (IEEE PIMRC 2009), pp.2807-2811, Tokyo, Japan, Sep. 13-16, 2009. [EI](NSC-98-2221-E-011-095-)",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, C. Changfan, K.-W. Su, and C.-F. Chen, “Design and Implementation of Music Information Retrieval and Gathering Engine (MIRAGE)”, The 10th The International Symposium on Pervasive Systems, Algorithms, and Networks (I-SPAN 2009), pp.498-501, Kaohsiung, Taiwan, Dec. 14-16, 2009.[EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, “Empirical Analysis of Authentication Process in a Cooperative B3G Network,” the 17th International Conference on Computer Communications and Networks (IC3N 2008), pp. 1 - 5, St. Thomas U.S. Virgin Islands, USA, August 3-7, 2008. [EI] (Acceptance Rate: 98/399 = 24.6%)",
	"type" : "conference"
  },
  {
    "papername" : "H.-C. Hsieh, J.-S. Leu, and W.-K. Shih,“Improving Fault-Tolerant Scheme for a Time-Sensitive Autonomous Local Wireless Sensor Network”, The International Conference on Mobile Technology, Applications and Systems 2008(ACM Mobility Conference 2008), Yilan, Taiwan, September 10-12, 2008. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, and H.-C. Hsieh, “An Autonomous Wireless Sensor Network with Fault Resilience,” The 4th IEEE International Conference on Wireless and Mobile Computing, Networking and communication (IEEE WiMob 2008), pp. 223 - 227, Avignon, France, October 12-14, 2008. [EI](Acceptance Rate: 85/300 = 28.3%)",
	"type" : "conference"
  },
  {
    "papername" : "H.-C. Hsieh, J.-S. Leu, Y.-C. Chen, and W.-K. Shih, “Fault Detecting Scheme for Unstructured P2P Network Systems,” the IADIS International Conference Wireless Applications and Computing 2008 (IADIS WAC 2008), pp. 119-123, Amsterdam, The Netherlands, July 22-24 , 2008.",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, H.-C. Hsieh, Y.-C. Chen, and Y.-P. Chi, “Design and Implementation of a Low Cost DNS-based Load Balancing Solution for the SIP-based VoIP Service”, 2008 IEEE Asia-Pacific Services Computing Conference (IEEE APSCC 2008), pp.310-314, Yilan, Taiwan, December 9-12, 2008. [EI](Acceptance Rate: 100/397 = 25%)(NSC-97-2221-E-011-085-)",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, “Design and Implementation of A Lightweight Brokering System for Content/Service Charging in a Cellular Network Centric Business Mode,” The 66th IEEE Vehicular Technology Conference (IEEE VTC 2007 Fall), pp.1990-1994, Baltimore, MD, USA, October 1-3, 2007. [EI] (NSC-96-2218-E-011-004)",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, W.-K. Shih and Y.-P. Chi,“Improving AAA Message Forwarding Lookup Latency for WLAN Roaming in Cellular/PWLAN Environment,” the 2006 IEEE Consumer Communications and Networking Conference (IEEE CCNC 2006), Las Vegas, NV, USA, Jan. 8-10 2006. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-M. Chen, J.-S. Leu, H.-W. Wei, L.-P. Tung, Y.-T. Chou, W.-K. Shih, “Design and Implementation of Video on Demand Services over a Peer-to-peer Multioverlay Network,” International Conference on Signal Processing and Multimedia Applications (SIGMAP), Springer, pp. 186-198, Set?bal, Portugal, August 7-10, 2006. (One of Best Papers)",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, R.-H. Lai, H.-I. Lin and W.-K. Shih, “Practical Considerations on End-to-End Cellular/PWLAN Architecture in support of Bilateral Roaming,” the 2005 IEEE Wireless Communications and Networking Conference (IEEE WCNC 2005), Vol. 3, pp. 1702 - 1707, New Orleans, LA, USA, Mar. 13-17 2005. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, Y.-P. Chi, S.-C. Chang and W.-K. Shih, “BRAINS: Blog Rendering and Accessing Instantly System,” IEEE International Conference on Wireless and Mobile Computing, Networking and Communications(IEEE WiMob 2005), Vol. 4, pp. 1 - 4, Montreal, Canada, Aug. 22-24 2005. [EI]",
	"type" : "conference"
  },
  {
    "papername" : "J.-S. Leu, H.-M. Kuo and S.-C. Chang, “Real-Time Information Aggregator: Visualizing SMS and MMS Messages System,” The Sixth International Conference on Information Integration and Web-based Applications & Services (IIWAS 2004), Jakarta, Indonesia, pp. 261-265, Aug. 27-29 2004.",
	"type" : "conference"
  }
]
