[
  {
    "papername" : "J.-S. Leu*, M.-C. Yu and H.-J. Tzeng, “Improving Indoor Positioning Precision by Using Received Signal Strength Fingerprint and Footprint Based on Weighted Ambient Wi-Fi Signals,” Computer Networks (ComNet), Elsevier [SCI,EI] (Accepted)",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, W.-B. Hsieh, Y.-S. Yee, “Implementing Billing as a Service by an IPDR Aggregator System,” Wireless Personal Communications(WPC), Springer [SCI,EI](Accepted)",
  "type" : "journal"
  },
  {
    "papername" : "H.-L. Yeh, T.-Y. Chen, H.-W. Wei*, N.-I Hsu, J.-S. Leu and H.-Y. Chen, “CloudBook: Implementing an E-Book Reader on a Cloud Platform by an Optimized Vector Graphic Library,” Computer Standards & Interfaces (CSI), Elsevier [SCI,EI](Accepted)",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, K.-C. Hsu, and T. Song, “Enhancing the Presence Service Efficiency of Internet Protocol Multimedia Subsystem-based Web Services,” Wireless Personal Communications, Springer [SCI,EI] (Accepted)",
  "type" : "journal"
  },
  {
    "papername" : "T.-Y. Chen, H.-W. Wei, Y.-C. Cheng, J.-S. Leu, W.-K. Shih, N.-I Hsu, “Integrating an e-book Software with Vector Graphic Technology on Cloud Platform,” Procedia - Social and Behavioral Sciences, Elsevier, Vol. 176, pp. 1012-1019, Feb. 2015",
  "type" : "journal"
  },
  {
    "papername" : "K.-H. Li and J.-S. Leu*, “Weakly Connected Dominating Set-Assisted Ant-based Routing Protocol for Wireless Ad-hoc Networks,” Computers and Electrical Engineering, Elsevier [SCI,EI] (Accepted)",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, T.-H. Chiang, M.-C. Yu, and K.-W. Su, “Energy Efficient Clustering Scheme for Prolonging the Lifetime of Wireless Sensor Network with Isolated Nodes,” IEEE Communications Letters, Vol. 19, Issue 2, pp. 259-262, Feb. 2015 [SCI,EI]",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, J.-H. Chen, and K.-H. Li, “Hybrid Search Scheme for Social Networks Supported by Dynamic Weighted Distributed Label Clustering,” IEEE Transactions on Computers, Vol. 64, No. 9, pp. 2586-2594, Sep. 2015 [SCI,EI]",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu* and Z.-Y. Zhu, “Regression-based Parking Space Availability Prediction for the Ubike System,” IET Intelligent Transport Systems, Vol. 9, Issue 3, pp. 323-332, Mar. 2015 [SCI,EI]",
  "type" : "journal"
  },
  {
    "papername" : "K.-H. Li, J.-S. Leu*, J. Hosek, “Swarm-based Routing Protocol Assisted by Weakly Connected Dominating Sets for Mobile Ad-hoc Networks,” Journal of Internet Technology [SCI,EI] (Accepted)",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, W.-H. Lin, W.-B. Hsieh, C.-C. Lo, “Design and Implementation of a VoIP broadcasting Service over Embedded Systems in a Heterogeneous Network Environment,” The Scientific World Journal, Hindawi, Vol. 2014, Article ID 917060 [SCI,EI]",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, M.-C. Yu, H.-C. Yueh, “Improving Network Coding Based File Sharing for Unstructured Peer-to-Peer Networks,” Journal of the Network and Systems Management, Springer [SCI,EI](accepted)",
  "type" : "journal"
  },
  {
    "papername" : "T.-K. Cheng, J.-S. Leu*, I.-X. Chen, J.-L. C. Wu and Z.-Y. Zhu, “Practical Context Awareness Information System for Wireless Vehicular Networks based on a Core Telematics Platform,” International Journal of Distributed Sensor Networks, Hindawi, Vol. 2014, Article ID 929165 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "W.-B. Hsieh* and J.-S. Leu, “An Anonymous Mobile User Authentication Protocol Using Self-certified Public Keys Based on Multi-server Architectures,” Special Issue: Hybrid Information Security Technologies, Journal of Supercomputing [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, H.-C. Yueh, I.-C. Chang, “A Virtual Grouping Based Fault-Tolerant Scheme for Autonomous Networks,” Engineering Applications of Artificial Intelligence(EAAI), Elseiver, Vol. 27, Issue 1, pp. 199-210, Jan. 2014 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu* and N. H. Tung, “Design and Implementation of a Reconfigurable Mobile Game Controller on Smartphone,” Wireless Personal Communications(WPC), Springer, Vol. 74, Issue 2, pp. 823-833, Jan. 2014 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu* and W.-B. Hsieh, “Efficient and secure dynamic ID based remote user authentication scheme for distributed systems using smart cards,” IET Information Security, Vol. 8, Issue 2, pp. 104–113, Mar. 2014 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "T.-K. Cheng, J.-L. C. Wu, F.-M. Yang*, J.-S. Leu, “IEEE 802.16e/m Energy-Efficient Sleep-Mode Operation with Delay Limitation in Multi-Broadcast Services,” International Journal of Communication Systems(IJCS), Wiley, Vol. 27, Issue 1, pp. 45–67, Jan. 2014 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "W.-B. Hsieh* and J.-S. Leu, “A Robust User Authentication Scheme Using Dynamic Identity in Wireless Sensor Network,” Wireless Personal Communications(WPC), Springer [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "W.-B. Hsieh* and J.-S. Leu, “A Robust User Authentication Scheme Using Dynamic Identity in Wireless Sensor Network,” Wireless Personal Communications(WPC), Springer, Vol. 77, Issue 2, pp. 979-989, Jul. 2014 [SCI,EI]",
  "type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, W.-H. Lin, J.-H. Chen, “P2P Resource Searching with Cloning Random Walker Assisted by Weakly Connected Dominating Set,” Journal of Supercomputing, Springer [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, C.-F. Chen, and K.-C. Hsu, “Improving Heterogeneous SOA-based IoT Message Stability by Shortest Processing Time Scheduling,” IEEE Transactions on Services Computing [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, K.-W. Su, C.-T. Chen, “Ambient Mesoscale Weather Forecasting System Featuring Mobile Augmented Reality,” Multimedia Tools and Applications (MTAP), Springer [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, N. H. Tung, and C.-Y. Liu, “Non-parametric RSS Prediction Based Energy Saving Scheme for Moving Smartphones,” IEEE Transactions on Computers [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "W.-B. Hsieh* and J.-S. Leu, “A Time and Location Information Assisted OTP Scheme,” Wireless Personal Communications(WPC), Springer, Vol. 72, Issue 1, pp. 509-519, Sep. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "M.-C. Yu, J.-S. Leu*, “Kernel Weighted Scheme for Improving Mobile Sensor Node Connectivity,” IEEE Sensors Journal, Vo1. 13, No. 4, pp. 1200-1206, Apr. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "M.-S. Lin, J.-S. Leu*, K.-H. Li, and J.-L. C. Wu, “TABOA: Terrain-aware Beacon Order Adaptation Scheme in 3D Zigbee Sensor Networks,” IEEE Wireless Communications, Vol. 20, Issue 2, pp. 28-36, Apr. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "M.-S. Lin, J.-S. Leu*, K.-H. Li, and J.-L. C. Wu, “Zigbee-based Internet of Things in 3D Terrains,” Computers and Electrical Engineering (CEE), Vol. 39, Issue 6, pp. 1667-1683, Aug. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, C. Changfan, K.-W. Su, and C.-F. Chen, “Design and Implementation of a Fixed-Mobile Convergent Music Search Engine(FMC-MUSE),” Wireless Personal Communications(WPC), Springer, Vo1. 70, Issue 4, pp. 1911-1923, Jun. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "C.-P. Lin*, H.-L. Chen, J.-S. Leu, “Modeling and Evaluating IPTV Applications in WiMAX Networks”, Multimedia Tools and Applications (MTAP), Springer, Vol. 67, Issue 3, pp. 641-666, Dec. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, Y.-S. Yee, and W.-L. Chen, “Comparison of Map-Reduce and SQL on Large-scale Data Processing,” Special Issue: Parallel and Distributed Processing with Applications, Journal of the Chinese Institute of Engineers (JCIE), Vo1. 36, Issue 1, pp. 27-34, Jan. 2013 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "W.-B. Hsieh, J.-S. Leu*, “Anonymous Authentication Protocol Based on Elliptic Curve Diffie-Hellman for Wireless Access Networks,” Wireless Communications and Mobile Computing (WCMC), Wiley [SCI,EI] (Accepted)",
	"type" : "journal"
  },
  {
    "papername" : "W.-B. Hsieh, J.-S. Leu*, “Exploiting Hash Functions to Intensify the Remote User Authentication Scheme,” Computers & Security (COSE), Elsevier, Vol. 31, Issue 6, pp. 791–798, Sep. 2012 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "C.-P. Lin*, H.-L. Chen, J.-S. Leu, “A predictive handover scheme to improve service quality in the IEEE 802.21 network,” Computers and Electrical Engineering (CEE), Elseiver, Vol. 38, Issue 3, pp. 681-693, May 2012 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, W.-H. Lin, H.-J. Tzeng, C.-F. Chen, and M.-S. Lin, “Adaptive Frame Synchronization for Surveillance System across a Heterogeneous Network,” Special Issue: Advanced Issues in Artificial Intelligence and Pattern Recognition for Intelligent Surveillance System in Smart Home Environment, Engineering Applications of Artificial Intelligence (EAAI), Elseiver, Vol. 25, Issue 7, pp. 1299-1528, Oct. 2012 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "P.-C. Liu, J.-S. Leu*, T.-C. Lee, T.-H. Chen, Y.-S. Yee and W.-K. Shih, “WuKong : A Practical Video Streaming Service Based on Native BitTorrent and Scalable Video Coding,” Multimedia Tools and Applications (MTAP), Springer, Vo1. 60, No. 1, pp. 47-68, Sep. 2012 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "M.-S. Lin*, J.-S. Leu, W.-C. Yu, M.-C. Yu, J.-L. C. Wu, “BOB-RED Queue Management for IEEE 802.15.4 Wireless Sensor Networks,” EURASIP Journal on Wireless Communications and Networking 2011, 2011:107 doi:10.1186/1687-1499-2011-107 [SCI,EI](NSC- 100-2221-E-011-154-)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu* and C.-K. Lin, “On Utilization Efficiency of Backbone Bandwidth for a Heterogeneous Wireless Network Operator,” Wireless Networks (WINET), ACM/Springer, Vol.17, No.7, pp. 1595-1604, Oct. 2011 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu* and S.–F. Chen, “TRASS: A Transmission-Rate Adapted Streaming Server in a Wireless Environment,” International Journal of Communication Systems(IJCS), Wiley, Vol. 24, Issue 7, pp. 852-871, Jul. 2011[SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, W.-H. Lin, “Improving the IP-based Authentication Process in a Cooperative B3G Network,” IET Communications, Vol. 5, Issue 5, pp. 667–675, Mar. 2011 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-M. Chen, J.-S. Leu*, Y.-C. Chen, H.-W. Wei, W.-K. Shih, “MegaDrop: A Cooperative Video-on-Demand System in a Peer-to-Peer Environment,” Journal of Information Science and Engineering(JISE), Vol.27, No.4, pp. 1345-1361, Jul. 2011[SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, H.-C. Hsieh, and Y.-C. Chen, “Inexpensive High Availability Solutions for the SIP-based VoIP Service,” Multimedia Tools and Applications (MTAP), Springer, Vo1. 53, Issue 1, pp. 285-301, May 2011 [SCI,EI] (NSC-97-2221-E-011-085-)"
  },
  {
    "papername" : "J.-S. Leu*, C.-W. Tsai and W.-H. Lin, “Resource Searching in an Unstructured P2P Network Based on Cloning Random Walker Assisted by Dominating Set,” Computer Networks (ComNet), Elsevier, Vo1. 55, No. 3, pp. 722-733, Feb. 2011 [SCI,EI] (NSC-98-2221-E-011-095-)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, “Crafting a Real-Time Information Aggregator for Mobile Messaging,” Special Issue: Lightweight Mobile and Wireless Systems: Technologies, Architectures, and Services, Journal of Computer Systems, Networks, and Communications, Hindawi, Vol. 2010, doi:10.1155/2010/209617[SCOPUS]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, W.-H. Lin, and H.-J. Tzeng, “Design and Implementation of a Mobile Home Surveillance System,” Special issue: Intelligent Buildings and Smart Homes Conference 2009 (IBASH2009), Journal of the Chinese Institute of Engineers (JCIE), Vo1. 33, No. 5, pp. 669-680, Jul. 2010 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "H.-C. Hsieh*, J.-S. Leu, and W.-K. Shih, “A Fault-Tolerant Scheme for an Autonomous Local Wireless Sensor Network,” Computer Standards & Interfaces (CSI), Elsevier, Vo1. 32, Issue 4, pp. 215-221, Jun. 2010[SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "H.-C. Hsieh*, J.-S. Leu and W.-K. Shih, “Reaching Consensus Underlying an Autonomous Local Wireless Network,” International Journal of Innovative Computing, Information and Control (IJICIC), Vo1. 6, No. 4, pp. 1905-1914, Apr. 2010 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu* and C.-W. Tsai, “Practical Design of a Proxy Agent to Facilitate Adaptive Video Streaming Service across Wired/Wireless Networks,” Journal of Systems and Software (JSS), Elsevier, Vo1. 82, Issue 11, pp. 1916-1925, Nov. 2009 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, “A Lightweight Brokering System for Content/Service Charging in a Cellular Network Centric Business Model,” Computer Communications, Elsevier, Vo1. 31, Issue 10, pp. 2078-2085, Jun. 2008 [SCI,EI] (NSC-96-2218-E-011-004)",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, Y.-P. Chi and W.-K. Shih, “Design and Implementation of Blog Rendering and Accessing Instantly System (BRAINS),” Journal of Network and Computer Applications (JNCA), Elsevier, Vo1. 30, Issue 1, pp. 296-307, Jan. 2007 [SCI,EI]",
	"type" : "journal"
  },
  {
    "papername" : "J.-S. Leu*, R.-H. Lai, H.-I. Lin and W.-K. Shih, “Running Cellular/PWLAN Services: Practical Considerations on Cellular/PWLAN Architecture supporting Interoperator Roaming,” IEEE Communications Magazine, Vol. 44, Issue. 2, pp. 111-122, Feb. 2006 [SCI,EI]",
	"type" : "journal"
  }
]
