[
  {
    "zh-TW": "賀！呂政修老師指導學生 蘇冠武、許任捷、謝禾彥、陳柏翰 參加「2017 Microsoft Indoor Localization Competition @ IPSN 2017」以「Implementing an iBeacon Indoor Positioning System using Ensemble Learning Algorithm」榮獲2D組第四名!",
    "en-US": "",
    "time": "2017/08/07"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 許任捷、謝禾彥、洪嘉男、王翊帆 參加「2016第七屆校園創意創業競賽」以「Brunch」榮獲專利商品化第三名！",
    "en-US": "",
    "time": "2017/08/07"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 董祐瑋、蔡佾勳、洪嘉男、陳彥達、許任捷、王翊帆、饒志鴻 參加「2016第21屆全國大專校院資訊應用服務創新競賽」以「NFC智慧藥盒」榮獲智慧型手持裝置兩岸交流應用組佳作！",
    "en-US": "",
    "time": "2017/08/07"
  },
  {
    "zh-TW": "恭賀！呂政修老師 榮獲 台灣科技大學 104學年度優良研究及創作獎！",
    "en-US": "Teacher Leu was rewarded NTUST Excellent Research Award for the Semester Year-104",
    "time": "2016/03/17"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 饒志鴻、陳智峰參加「第二屆創意智慧生活競賽」以「NFC智慧藥盒」榮獲健康照護組第三名！",
    "en-US": "The students Chih Hung, Chih Feng, were rewarded Third Place by NFC Intelligent Medicine Dispenser in 2016 SIGMU Intelligent Competition",
    "time": "2015/03/06"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 蘇冠武、邱靖倢、王秉軒、許任捷、楊程皓參加「2015第六屆校園創意創業競賽」以「在地A腳步」榮獲專利商品化第一名！",
    "en-US": "The students Thomas Leonard Su, Ryan Chiu, Bing Syuan, Ren Chieh, Cheng Hao, were rewarded First Place by 在地A腳步 in 2015 Innovation & Entrepreneurship Competition",
    "time": "2015/12/10"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 邱靖倢、邱昶學、王紫綺、許任捷參加「2015第20屆全國大專校院資訊應用服務創新競賽」以「Fooney即食」榮獲智慧型手持裝置兩岸交流應用組第二名！",
    "en-US": "The students Ryan Chiu, Michael Chiu, Tz Chi, Ren Chieh, were rewarded Second Award by Fooney in International ICT Innovative Services Awards 2015",
    "time": "2015/10/31"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 程文志、饒志鴻、邱靖倢、許任捷參加「2015第20屆全國大專校院資訊應用服務創新競賽」以「NumberCatcher-智慧型排隊系統」榮獲智慧型手持裝置兩岸交流應用組佳作！",
    "en-US": "The students Wen Chih, Chih Hung, Ryan Chiu, Ren Chieh, were rewarded Excellent Award by NumberCatcher in International ICT Innovative Services Awards 2015",
    "time": "2015/10/31"
  },
  {
    "zh-TW": "賀！呂政修老師指導 學生王秉軒、邱靖倢、陳聖凱、吳勇霆、許任捷參加「2015第20屆全國大專校院資訊應用服務創新競賽」以「iAngel 愛的天使」榮獲智慧型手持裝置兩岸交流應用組佳作！",
    "en-US": "The students Bing Syuan, Ryan Chiu, Yong Ting, Sheng Kai, Ren Chieh, were rewarded Excellent Award by iAngel in International ICT Innovative Services Awards 2015",
    "time": "2015/10/31"
  },
  {
    "zh-TW": "賀！呂政修老師 指導 學生 蘇冠武、游敏杰、江東鴻 參加「2015 MATLAB/Simulink技術與應用文章/論文徵選」 以「Prolonging the Lifetime of WiNeMO with Isolated Node Problem Using Energy Efficient Clustering Scheme」獲得優選第二名！",
    "en-US": "The students Thomas Leonard Su, Min Chieh Yu, Dong Hong, were rewarded Second Award by Prolonging the Lifetime of WiNeMO with Isolated Node Problem Using Energy Efficient Clustering Scheme in 2015 MATLAB & Simulink Tech Forum and Expo",
    "time": "2015/10/21"
  },
  {
    "zh-TW": "賀！本實驗室 碩士生邱靖倢 獲選 北區技專院校教學資源中心「103學年度北區傑出教學助理」！",
    "en-US": "Ryan Chiu, the graduate student, was rewarded Exceptional Teacher Assistant by CTLE in Northern Region, Ministry of Education.",
    "time": "2015/06/09"
  },
  {
    "zh-TW": "賀！本實驗室 碩士生詹佳芸 當選 台灣科技大學「103學年第九屆校園 傑出青年」！",
    "en-US": "Alice Chan, the graduate student, was rewarded the 8th \"Extrodanary Teens\" in NTUST.",
    "time": "2015/03/22"
  },
  {
    "zh-TW": "賀！呂政修老師 指導 學生 詹佳芸、薛乃榮、楊長廷、邱靖倢、顧詔勛 參加「2014健康照護科技應用競賽」 以主題「iAngel-愛的天使：守護你所關心的人」榮獲APP組第三名！",
    "en-US": "The students Alice Chan, Xue Nai Rong, Yang Ting, Ryan Chiu and Ku Chao Hsun, were rewarded Third Award by iAngel in Health Care Technology Contest 2014",
    "time": "2015/01/09"
  },
  {
    "zh-TW": "賀！呂政修老師 指導 碩士生朱哲儀、詹佳芸 參加「2014年智慧型手持裝置使用者體驗設計競賽」以主題「OmniPlay」榮獲實作組第三名與HTC企業獎！",
    "en-US": "The graduate students Chu Che Yi and Alice Chan were rewarded Third Award and HTC Business Prize by \"OmniPlay\" in MobileHeros",
    "time": "2014/12/03"
  },
  {
    "zh-TW": "賀！本實驗室 碩士生詹佳芸 榮獲 「103年度Garmin 獎學金」",
    "en-US": "Alice Chan, the graduate student, was rewarded the annual scholarship from Garmin.",
    "time": "2014/11/28"
  },
  {
    "zh-TW": "賀！呂政修老師 指導 學生邱靖倢、朱家毅、張哲睿 參加「第二屆台灣盃 Freescale Cup 智能車大賽」榮獲 佳作！",
    "en-US": "Ryan Chiu, Chu Cha Yi and Chan Che Re, were rewarded a Excellent Work in Freescale Cup 2014.",
    "time": "2014/07/14"
  },
  {
    "zh-TW": "賀！本實驗室 專題生邱靖倢 當選 台灣科技大學「102學年第八屆電資學院 傑出青年」！",
    "en-US": "Ryan Chiu was rewarded the 8th \"Extrodanary Teens\" in NTUST.",
    "time": "2014/03/12"
  },
  {
    "zh-TW": "恭賀！呂政修老師 榮升 台灣科技大學電子工程系 教授 全體實驗室恭賀！",
    "en-US": "Teacher Leu was promoted as Professor of the Department of Electronic and Computer Engineering in NTUST.",
    "time": "2014/02/01"
  },
  {
    "zh-TW": "賀！呂政修老師指導 碩士生朱哲儀參加「2013全國資通訊應用暨智慧電子專題競賽」以主題「Skywalker」榮獲大專組第三名！",
    "en-US": "Student Chu Che Yi, was rewarded Third Award by Skywalker in National IT and Smart Devices Contest.",
    "time": "2014/01/09"
  },
  {
    "zh-TW": "賀！呂政修老師指導 碩士生江東鴻參加「2013網路創意生活智慧家APP行動大賽」以「Nezh-TWork Guard」榮獲學生組第二名！",
    "en-US": "Student Dong Hong, was rewarded Second Award by Nezh-TWork Guard in TWNIC 2013.",
    "time": "2014/01/09"
  },
  {
    "zh-TW": "賀！本實驗室 碩士生李坤翰 以論文 “移動隨意網路中以弱連結支配集為輔之基於蟻群的需求式分群路由演算法”獲選「2013中華民國資訊學會」最佳碩士論文獎 佳作！ ",
    "en-US": "Graduate student Li Kun Han, was rewarded the Excellent Work by paper \"Weakly Connected Dominating Set-Assisted Ant-based Routing Protocol for Wireless Ad-hoc Networks\" in Best Thesis Award.",
    "time": "2014/01/09"
  },
  {
    "zh-TW": "恭賀！呂政修老師 榮升 台灣科技大學電子工程系 副系主任 全體實驗室恭賀！",
    "en-US": "Teacher Leu was promoted as Vice President of the Department of Electronic and Computer Engineering in NTUST.",
    "time": "2014/01/01"
  },
  {
    "zh-TW": "賀！呂政修老師 指導 學生邱靖倢、陳柏翰 參加「第一屆台灣盃 Freescale Cup 智能車大賽」榮獲 佳作！",
    "en-US": "Students Ryan Chiu, Chen Po Han, were rewarded a Excellent Work in Freescale Cup 2013.",
    "time": "2013/07/13"
  },
  {
    "zh-TW": "賀！呂政修老師指導學生 江東鴻、朱天瑜、徐堃哲、吳明翠參加 「2013第18屆全國大專校院資訊應用服務創新競賽」以主題「BBGO」榮獲 悠遊卡好便利創新應用組第三名！",
    "en-US": "Students Dong Hong, Tien Yu, Kun Che were rewarded Third Award in International ICT Innovative Services Awards 2015.",
    "time": "2013/11/15"
  }
]